<center>Name:Quratulain<br>
Email:QuratulainAIML@hotmail.com<br>
Github:QuratulainAIML<br>
Title: Project of Data Analysis and Data Cleaning</center>

Installing libraries

In [8]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\qurat\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\qurat\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [9]:
%pip install numpy

Requirement already satisfied: numpy in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Note: you may need to restart the kernel to use updated packages.

Importing libraries

In [10]:
import pandas as pd

In [11]:
import numpy as np

load the CSV data into DataFrame

In [12]:
#loading dataset
df=pd.read_csv('data1.csv')
print("This is my CSV dataset")
df

This is my CSV dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Explore the data

In [13]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [14]:
print(df.describe())

       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

Checking null values

In [15]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Removing Null values from Age,Cabin ,Fare and Embark Columns

In [16]:
msa=df['Age'].mean()
df['Age'].fillna(msa,inplace=True)
df['Age'].isnull().sum()

C:\Users\qurat\AppData\Local\Temp\ipykernel_14108\2892904856.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(msa,inplace=True)

np.int64(0)

In [17]:
FareMedian=df['Fare'].median()
df['Fare'].fillna(FareMedian, inplace=True)
df['Fare'].isnull().sum()

C:\Users\qurat\AppData\Local\Temp\ipykernel_14108\1639950143.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Fare'].fillna(FareMedian, inplace=True)

np.int64(0)

In [18]:
CabinCount=df['Cabin'].count()
df['Cabin'].fillna(CabinCount, inplace = True)
df['Cabin'].isnull().sum()
df['Cabin']

C:\Users\qurat\AppData\Local\Temp\ipykernel_14108\3703879740.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Cabin'].fillna(CabinCount, inplace = True)

0       204
1       C85
2       204
3      C123
4       204
       ...
886     204
887     B42
888     204
889    C148
890     204
Name: Cabin, Length: 891, dtype: object

In [19]:
EmbarkedCount=df['Embarked'].count()
df['Embarked'].fillna(EmbarkedCount, inplace = True)
df['Embarked'].isnull().sum()

C:\Users\qurat\AppData\Local\Temp\ipykernel_14108\2711600417.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Embarked'].fillna(EmbarkedCount, inplace = True)

np.int64(0)

In [20]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

Setting Limites for dataset

In [21]:
df['Age']=df['Age'].apply(lambda x: x if x < 100 else msa)
df['Age']=df['Age'].apply(lambda x: x if x > 18 else msa)
df['Age']

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [22]:
df['Fare']=df['Fare'].apply(lambda x: x if x > 20 else FareMedian)
df['Fare']=df['Fare'].apply(lambda x: x if x < 40.0000 else FareMedian)
df['Fare']

0      14.4542
1      14.4542
2      14.4542
3      14.4542
4      14.4542
        ...
886    14.4542
887    30.0000
888    23.4500
889    30.0000
890    14.4542
Name: Fare, Length: 891, dtype: float64

Now removing Unnecessary columns

In [23]:
df=df.drop(columns=['PassengerId','Pclass','SibSp','Cabin','Parch','Cabin'])
df

,Survived,Name,Sex,Age,Ticket,Fare,Embarked
0,0,"Braund, Mr. Owen Harris",male,22.000000,A/5 21171,14.4542,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,PC 17599,14.4542,C
2,1,"Heikkinen, Miss. Laina",female,26.000000,STON/O2. 3101282,14.4542,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,113803,14.4542,S
4,0,"Allen, Mr. William Henry",male,35.000000,373450,14.4542,S
...,...,...,...,...,...,...,...
886,0,"Montvila, Rev. Juozas",male,27.000000,211536,14.4542,S
887,1,"Graham, Miss. Margaret Edith",female,19.000000,112053,30.0000,S
888,0,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,W./C. 6607,23.4500,S
889,1,"Behr, Mr. Karl Howell",male,26.000000,111369,30.0000,C
890,0,"Dooley, Mr. Patrick",male,32.000000,370376,14.4542,Q

Replacing F for Female and M for Male in Sex column

In [24]:
df['Sex'] = df['Sex'].replace({'Female': 'F', 'Male': 'M'})
df['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

Assign 0 for Death and 1 for Alive in Sex column

In [25]:
df['Survived'] = df['Survived'].replace({0: 'Death', 1: 'Live'})
df['Survived']

0      Death
1       Live
2       Live
3       Live
4      Death
       ...
886    Death
887     Live
888    Death
889     Live
890    Death
Name: Survived, Length: 891, dtype: object

Replacing S for southampton C for cherbourg and  for Queenstown in Emberked column

In [26]:
df['Embarked'] = df['Embarked'].replace({'S': 'Southasia', 'C': 'China','Q':'Qattar'})
df['Embarked']

0      Southasia
1          China
2      Southasia
3      Southasia
4      Southasia
         ...
886    Southasia
887    Southasia
888    Southasia
889        China
890       Qattar
Name: Embarked, Length: 891, dtype: object

Groupby Sex column and Calculate its mean fare for each group

In [27]:
FareGender=df.groupby('Sex')['Fare'].mean()
FareGender

Sex
female    17.691798
male      17.425171
Name: Fare, dtype: float64

Display fare greater than 10000

In [28]:
HighFare=df[df['Fare'] > 10.000000]
HighFare

,Survived,Name,Sex,Age,Ticket,Fare,Embarked
0,Death,"Braund, Mr. Owen Harris",male,22.000000,A/5 21171,14.4542,Southasia
1,Live,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,PC 17599,14.4542,China
2,Live,"Heikkinen, Miss. Laina",female,26.000000,STON/O2. 3101282,14.4542,Southasia
3,Live,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,113803,14.4542,Southasia
4,Death,"Allen, Mr. William Henry",male,35.000000,373450,14.4542,Southasia
...,...,...,...,...,...,...,...
886,Death,"Montvila, Rev. Juozas",male,27.000000,211536,14.4542,Southasia
887,Live,"Graham, Miss. Margaret Edith",female,19.000000,112053,30.0000,Southasia
888,Death,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,W./C. 6607,23.4500,Southasia
889,Live,"Behr, Mr. Karl Howell",male,26.000000,111369,30.0000,China
890,Death,"Dooley, Mr. Patrick",male,32.000000,370376,14.4542,Qattar

Groupby Age and calculate its mean fare

In [29]:
grp=df.groupby('Age')['Fare'].mean()
print(grp)

Age
19.0    17.364692
20.0    14.454200
20.5    14.454200
21.0    15.284233
22.0    14.992933
          ...
70.0    14.454200
70.5    14.454200
71.0    24.554200
74.0    14.454200
80.0    30.000000
Name: Fare, Length: 65, dtype: float64

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    object
 1   Name      891 non-null    object
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   Ticket    891 non-null    object
 5   Fare      891 non-null    float64
 6   Embarked  891 non-null    object
dtypes: float64(2), object(5)
memory usage: 48.9+ KB

In [31]:
df.describe()

              Age        Fare
count  891.000000  891.000000
mean    32.660405   17.519133
std      9.875038    6.153105
min     19.000000   14.454200
25%     28.250000   14.454200
50%     29.699118   14.454200
75%     35.000000   14.454200
max     80.000000   39.687500

In [33]:
df.to_csv('DataAnalysisProject.csv',index=False)